var end = 0;
var wrong = 0;
var wrong2 = 0;
var correct = 16;
var wrongs = new Array;
var ques = new Array;
var set = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
var time_table = [1, 6, 3, 5, 4, 2];
var done = 0;

class Question {
    constructor(qtext, ans, right, info, link) {
        this.qtext = qtext;
        this.ans = ans;
        this.right = right;
        this.info = info;
        this.link = link;
        this.used = 0;
    }
};

q0 = new Question("Кой владетел обединява българите в „Стара Велика България“?", ["Крум", "Кубрат", "Аспарух", "Тервел"], 1, "Първи български владетел и основател на Велика България.", "https://bg.wikipedia.org/wiki/%D0%9A%D1%83%D0%B1%D1%80%D0%B0%D1%82");
q1 = new Question("Кой български владетел основава новата българска държава?", ["Кубрат", "Крум", "Аспарух", "Тервел"], 2, "Син на основателя на Велика България.", "https://bg.wikipedia.org/wiki/%D0%90%D1%81%D0%BF%D0%B0%D1%80%D1%83%D1%85");
q2 = new Question("Как се нарича титлата на българския владетел при основаването на държавата?", ["Княз", "Крал", "Цар", "Хан (кан)"], 3, "Титлата е използвана на места в историографията и за останалите владетели на Първата българска държава преди официалното приемане на християнството.", "https://bg.wikipedia.org/wiki/%D0%A5%D0%B0%D0%BD_(%D1%82%D0%B8%D1%82%D0%BB%D0%B0)");
q3 = new Question("Кой български владетел завоюва областта Загоре и получава титла „кесар“ от Византия?", ["Крум", "Аспарух", "Омуртаг", "Тервел"], 3, "Вторият владетел на новата българска държава. Управлявал е през периода 700 – 721 .", "https://bg.wikipedia.org/wiki/%D0%A2%D0%B5%D1%80%D0%B2%D0%B5%D0%BB");
q4 = new Question("При управлението на кой български владетел се разгръща мащабно строителство?", ["Крум", "Омуртаг", "Маламир", "Борис I"], 1, "Управлява през от 814 до 831 г. Знаменитият му надпес е : “Човек и добре да живее, умира и друг се ражда. Нека роденият по-късно, като гледа този надпис, да си спомня за оногова, който го я направил. Нека Бог да го удостои да преживее сто години.“", "https://bg.wikipedia.org/wiki/%D0%9E%D0%BC%D1%83%D1%80%D1%82%D0%B0%D0%B3#%D0%A1%D1%82%D1%80%D0%BE%D0%B8%D1%82%D0%B5%D0%BB%D0%BD%D0%B0_%D0%B4%D0%B5%D0%B9%D0%BD%D0%BE%D1%81%D1%82");
q5 = new Question("Кой български владетел оказва помощ на Византия при обсадата на Константинопол от арабите?", ["Омуртаг", "Аспарух", "Тервел", "Крум"], 2, "Вторият владетел на новата българска държава. Управлявал е през периода 700 – 721 .", "https://bg.wikipedia.org/wiki/%D0%A2%D0%B5%D1%80%D0%B2%D0%B5%D0%BB#%D0%A1%D1%8A%D1%8E%D0%B7%D1%8A%D1%82_%D1%81_%D0%AE%D1%81%D1%82%D0%B8%D0%BD%D0%B8%D0%B0%D0%BD_II");
q6 = new Question("При устието на коя река се намира областта Онгъл?", ["Дон", "Марица", "Днепър", "Дунав"], 3, "Втората по дължина река в Европа след Волга. Тя е единствената голяма река в Европа, която тече в посока от запад на изток и се влива в Черно море.", "https://bg.wikipedia.org/wiki/%D0%9E%D0%BD%D0%B3%D1%8A%D0%BB");
q7 = new Question("Кое от следните твърдения за битката при Онгъла е вярно?", ["Онгъла е планинска местност, намираща се в подножието на 3-хилядник", "Император Константин IV Погонат заминава на лечение с минерални бани в разгара на обсадата", "В тази битка българите се съюзяват с куманите", "Счита се, че българската войска е била съставена от 50 000 души"], 1, "Предполага се, че императорът заминава да лекува подагра в минералните бани на Аква Калиде, Месемврия или Анхиало. Някои определят това негово действие като бягство, но независимо каква е истината, факт е, че то внася смут в редиците на византийците.", "https://bg.wikipedia.org/wiki/%D0%9E%D0%BD%D0%B3%D1%8A%D0%BB#%D0%91%D0%B8%D1%82%D0%BA%D0%B0%D1%82%D0%B0_%D0%BF%D1%80%D0%B8_%D0%9E%D0%BD%D0%B3%D1%8A%D0%BB%D0%B0");
q8 = new Question("През коя година се основава новата българска държава?", ["716", "681", "705", "632"], 1, "Годината, през която започва управлението на хан Аспарух.", "https://bg.wikipedia.org/wiki/%D0%9F%D1%8A%D1%80%D0%B2%D0%B0_%D0%B1%D1%8A%D0%BB%D0%B3%D0%B0%D1%80%D1%81%D0%BA%D0%B0_%D0%B4%D1%8A%D1%80%D0%B6%D0%B0%D0%B2%D0%B0#%D0%90%D1%81%D0%BF%D0%B0%D1%80%D1%83%D1%85");
q9 = new Question("През коя година Крум побеждава Византия при Върбишкия проход?", ["831", "811", "814", "809"], 1, "В същата година, в която Никифор събира войска и поема на нов поход срещу България.", "https://bg.wikipedia.org/wiki/%D0%91%D0%B8%D1%82%D0%BA%D0%B0_%D0%BF%D1%80%D0%B8_%D0%92%D1%8A%D1%80%D0%B1%D0%B8%D1%88%D0%BA%D0%B8%D1%8F_%D0%BF%D1%80%D0%BE%D1%85%D0%BE%D0%B4");
q10 = new Question("Признаване на българската държава от Византия?", ["681 г.", "700 г.", "689 г.", "677 г."], 0, "Годината, през която се основава новата българска държава.", "https://bg.wikipedia.org/wiki/%D0%9F%D1%8A%D1%80%D0%B2%D0%B0_%D0%B1%D1%8A%D0%BB%D0%B3%D0%B0%D1%80%D1%81%D0%BA%D0%B0_%D0%B4%D1%8A%D1%80%D0%B6%D0%B0%D0%B2%D0%B0");
q11 = new Question("Покръстването на България?", ["867 г.", "865 г.", "855 г.", "860 г."], 1, "13 години след началото на владението си. Годината, в която хан Борис I става Св. княз Борис I Михаил .", "https://bg.wikipedia.org/wiki/%D0%9F%D0%BE%D0%BA%D1%80%D1%8A%D1%81%D1%82%D0%B2%D0%B0%D0%BD%D0%B5_%D0%BD%D0%B0_%D0%91%D1%8A%D0%BB%D0%B3%D0%B0%D1%80%D0%B8%D1%8F");
q12 = new Question("Разгром на византийската армия при р. Ахелой?", ["920 г.", "913 г.", "910 г.", "917 г."], 3, "4 години след като Симеон I е провъзгласен за цар.", "https://bg.wikipedia.org/wiki/%D0%91%D0%B8%D1%82%D0%BA%D0%B0_%D0%BF%D1%80%D0%B8_%D0%90%D1%85%D0%B5%D0%BB%D0%BE%D0%B9");
q13 = new Question("Симеон обсажда Константинопол и е провъзгласен за цар?", ["900 г.", "920 г.", "910 г.", "913 г."], 3, "20 години след началото на управлението му.", "https://bg.wikipedia.org/wiki/%D0%A1%D0%B8%D0%BC%D0%B5%D0%BE%D0%BD_I");
q14 = new Question("Битката при Беласица (Ключ). Коя година по заповед на Василий II са ослепени 14000 български войници?", ["1014 г.", "1007 г.", "1010 г.", "1016 г."], 0, "Годината, в която цар Самуил е починал.", "https://bg.wikipedia.org/wiki/%D0%91%D0%B5%D0%BB%D0%B0%D1%81%D0%B8%D1%88%D0%BA%D0%B0_%D0%B1%D0%B8%D1%82%D0%BA%D0%B0");
q15 = new Question("Кой български владетел присъединява град Сердика (София) към българската държава?", ["Пресиян", "Маламир", "Крум", "Омуртаг"], 2, "Владетел през периода 803 – 814.", "https://bg.wikipedia.org/wiki/%D0%9E%D0%B1%D1%81%D0%B0%D0%B4%D0%B0_%D0%BD%D0%B0_%D0%A1%D0%B5%D1%80%D0%B4%D0%B8%D0%BA%D0%B0_(809)");
q16 = new Question("Кой византийски император оглавява похода срещу българите през 680 г.?", ["Никифор I", "Юстиниан II", "Юстиниан I", "Константин IV"], 3, "Преписан му е прякорът на баща му е “Погонат”.", "https://bg.wikipedia.org/wiki/%D0%91%D1%8A%D0%BB%D0%B3%D0%B0%D1%80%D0%BE-%D0%B2%D0%B8%D0%B7%D0%B0%D0%BD%D1%82%D0%B8%D0%B9%D1%81%D0%BA%D0%B8_%D0%B2%D0%BE%D0%B9%D0%BD%D0%B8#%D0%A3%D1%81%D1%82%D0%B0%D0%BD%D0%BE%D0%B2%D1%8F%D0%B2%D0%B0%D0%BD%D0%B5_%D0%BD%D0%B0_%D0%B1%D1%8A%D0%BB%D0%B3%D0%B0%D1%80%D0%B8_%D0%BD%D0%B0_%D0%91%D0%B0%D0%BB%D0%BA%D0%B0%D0%BD%D0%B8%D1%82%D0%B5");
q17 = new Question("Кой от посочените български владетели от VIII в. е удостоен със званието патриций?", ["Телериг", "Кардам", "Паган", "Токту"], 0, "Удостоен с византийското йерархично звание, след като е принуден да избяга във Византия след извършен срещу него метеж в Плиска. Смята се, че приема християнството в Константинопол под името Теофилакт.", "https://bg.wikipedia.org/wiki/%D0%A2%D0%B5%D0%BB%D0%B5%D1%80%D0%B8%D0%B3");
q18 = new Question("С кой византийски император Тервел сключва официална договорка, според която държавните граници на България са политически признати, а територията се разширява в областта Загоре?", ["Юстиниан II", "Лъв III", "Теодосий III", "Константин IV"], 2, "След смъртта на Юстиниан II и неговото отмятане от даряването на Загоре на Тервел, българският владетел предприема серия от офанзиви срещу Византия. В крайна сметка отношенията между двете държави са уредени след договора от 716 г., чрез който България получава удовлетворяване на исканията си. Същият договор се смята и за първият в историята на Европа, който урежда точни законови регламенти, чрез които да протича стоков обмен между две държави.", "https://bg.wikipedia.org/wiki/%D0%A2%D0%B5%D0%BE%D0%B4%D0%BE%D1%81%D0%B8%D0%B9_III_%D0%90%D0%B4%D1%80%D0%B0%D0%BC%D0%B8%D1%82");
q19 = new Question("С управлението на кой български владетел се свързва значителното разширение на българската държава в земите западно от река Струма и присъединяването на голяма част от териториите на днешна Македония?", ["Крум", "Омуртаг", "Борис I", "Пресиян"], 3, "Непрестанните конфликти на Византия с Абасидския халифат се разгарят с нова сила през IX в. Това и довежда до оголването на имперски владения на Балканите, от което българския владетел не закъснява да се възползва. Войските, които империята успява да мобилизира срещу българското проникване в Македония, са разгромени при Филипи.", "https://bg.wikipedia.org/wiki/%D0%9F%D1%80%D0%B5%D1%81%D0%B8%D1%8F%D0%BD");
q20 = new Question("Каква е роднинската връзка между владетелите Маламир и Пресиян?", ["Баща и син", "Чичо и племенник", "Тъст и зет", "Братя"], 1, "Пресиян е син на брата на Маламир – Звиница.", "https://bg.wikipedia.org/wiki/%D0%9F%D1%80%D0%B5%D1%81%D0%B8%D1%8F%D0%BD");
q21 = new Question("Кой от изброените владетели НЕ сключва договор за мир с Византия?", ["Аспарух", "Петър", "Омуртаг", "Владимир-Расате"], 3, "Княз на България от 889 до 893 г. Неговото кратко управление е свързано със сближаването с Източното франкско кралство. През 892 г. между двете държави е сключен дори военен съюз. Той е свален от престола от баща си Борис, тъй като прави опити да възпре налагането на християнството.", "https://bg.wikipedia.org/wiki/%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%A0%D0%B0%D1%81%D0%B0%D1%82%D0%B5");
q22 = new Question("Кирил и Методий създават славянската азбука:", ["820 г.", "865 г.", "855 г.", "905 г."], 2, "28 години след раждането на Кирил и 40 години след раждането на Методий.", "http://istoria.bg/1463/sazdavane-na-slavyanskata-pismenost");
q23 = new Question("Разгром на византийските войски във Върбишкия проход:", ["805 г.", "811 г.", "815 г.", "800 г."], 1, "8 години след началото на управление на хан Крум.", "https://bg.wikipedia.org/wiki/%D0%91%D0%B8%D1%82%D0%BA%D0%B0_%D0%BF%D1%80%D0%B8_%D0%92%D1%8A%D1%80%D0%B1%D0%B8%D1%88%D0%BA%D0%B8%D1%8F_%D0%BF%D1%80%D0%BE%D1%85%D0%BE%D0%B4");
q24 = new Question("Преславският събор. Симеон заема българския престол. Столицата е преместена от Плиска в Преслав. Изгонване на византийското духовенство. Старобългарският става официален държавен език вместо гръцкия:", ["890 г.", "799 г.", "880 г.", "893 г."], 3, "Годината, в която Св. княз Борис I Михаил детронира първородния си син Владимир Расате.", "https://bg.wikipedia.org/wiki/%D0%9F%D1%80%D0%B5%D1%81%D0%BB%D0%B0%D0%B2%D1%81%D0%BA%D0%B8_%D0%BD%D0%B0%D1%80%D0%BE%D0%B4%D0%B5%D0%BD_%D1%81%D1%8A%D0%B1%D0%BE%D1%80#%D0%9E%D0%B1%D1%81%D1%82%D0%B0%D0%BD%D0%BE%D0%B2%D0%BA%D0%B0_%D0%B2_%D0%91%D1%8A%D0%BB%D0%B3%D0%B0%D1%80%D0%B8%D1%8F_%D0%BA%D1%8A%D0%BC_893_%D0%B3.");
q25 = new Question("При кой български владетел град Филипопол за първи път е присъединен към територията на българската държава?", ["Тервел", "Маламир", "Крум", "Пресиян"], 1, "Когато през 836 г. мирният договор между България и Византия е нарушен от император Теофил, българите отвръщат с провеждането на военна акция във византийска Тракия. Начело на български войски е кавхан Исбул, който осъществява превземането на Филипопол.", "https://bg.wikipedia.org/wiki/%D0%98%D1%81%D1%82%D0%BE%D1%80%D0%B8%D1%8F_%D0%BD%D0%B0_%D0%9F%D0%BB%D0%BE%D0%B2%D0%B4%D0%B8%D0%B2#%D0%A1%D1%80%D0%B5%D0%B4%D0%BD%D0%BE%D0%B2%D0%B5%D0%BA%D0%BE%D0%B2%D0%B8%D0%B5");
q26 = new Question("За кой български владетел се отнасят Чаталарския и Търновския надпис?", ["Крум", "Тервел", "Омуртаг", "Аспарух"], 2, "При управлението му се разгръща мащабно строителство.", "https://bg.wikipedia.org/wiki/%D0%A2%D1%8A%D1%80%D0%BD%D0%BE%D0%B2%D1%81%D0%BA%D0%B8_%D0%BD%D0%B0%D0%B4%D0%BF%D0%B8%D1%81_%D0%BD%D0%B0_%D0%BA%D0%B0%D0%BD_%D0%9E%D0%BC%D1%83%D1%80%D1%82%D0%B0%D0%B3");
q27 = new Question("Кой е първият владетел на Първата българска държава, който според изворите не произхожда от рода Дуло?", ["Винех", "Севар", "Телец", "Кормисош"], 3, "Управлява България в периода 753 – 756 г.", "https://bg.wikipedia.org/wiki/%D0%9A%D0%BE%D1%80%D0%BC%D0%B8%D1%81%D0%BE%D1%88");
q28 = new Question("Кой от споменатите български аристократи според изворите НЕ е бил регент/съвладетел на Омуртаг?", ["Цог", "Дукум", "Исбул", "Диценг"], 2, "Като цяло не се знае почти нищо за личностите на Дукум, Диценг и Цог, освен че първоначално те държат част от властта в България, непосредствено след смъртта на Крум и възкачването на Омуртаг на българския престол. Кавхан Исбул от друга страна е бил могъщ български държавен сановник, изиграл голяма роля в последвалите десетилетия.", "https://bg.wikipedia.org/wiki/%D0%98%D1%81%D0%B1%D1%83%D0%BB");
q29 = new Question("С каква титла е упоменат българският владетел Борис I в надписа от Балши, Албания?", ["Император", "Архонт", "Канасубиги", "Цар"], 1, "Написан на гръцки език, титулът отбелязан в надписа обикновено се превежда просто като „владетел“.", "https://bg.wikipedia.org/wiki/%D0%90%D1%80%D1%85%D0%BE%D0%BD%D1%82");
q30 = new Question("Как е наречен цар Симеон I в кореспонденцията на византийския патриарх Николай Мистик до самия български владетел?", ["„Син на мира“", "„Син на Византия“", "„Дете на войната“", "„Син на науката“"], 0, "Смята се, че употребеното от византийския патриарх определение за Симеон се отнася до сключения между България и Византийската империя мирен договор от 865 г., довел до покръстването на българите. С това патриарх Николай ни насочва, че Симеон също е роден приблизително около 865 г., тоест във времето на мирно добросъседство между българите и ромеите.", "https://bg.wikipedia.org/wiki/%D0%A1%D0%B8%D0%BC%D0%B5%D0%BE%D0%BD_I#%D0%9F%D1%80%D0%BE%D0%B8%D0%B7%D1%85%D0%BE%D0%B4_%D0%B8_%D1%80%D0%B0%D0%BD%D0%BD%D0%B8_%D0%B3%D0%BE%D0%B4%D0%B8%D0%BD%D0%B8");
q31 = new Question("За коя битка се отнасят думите: „Никога не бих казал, дори и слънцето да би изчезнало, че българските стрели са по-силни от ромейските копия. Пропаднете дървета и зловещи планини, пропаднете там, където лъвът се изплаши от сърните. България грабна венеца на Рим.“?", ["Битката при Върбишкия проход", "Битката при Траянови врата", "Битката при Сперхей", "Битката при Ахелой"], 1, "Стихотворението на Йоан Геометър, редовете от които прочетохте по-горе, обрисува в думи срама на византийския творец от позорната загуба на огромната войска на император Василий II.", "https://bg.wikipedia.org/wiki/%D0%91%D0%B8%D1%82%D0%BA%D0%B0_%D0%BF%D1%80%D0%B8_%D0%A2%D1%80%D0%B0%D1%8F%D0%BD%D0%BE%D0%B2%D0%B8_%D0%B2%D1%80%D0%B0%D1%82%D0%B0");
q32 = new Question("Към кой български владетел адресира следните думи византийският император Константин VI: „Изпратих ти данък какъвто ти подобава. Ти си стар и аз не искам да се мориш чак дотук. Аз ще дойда до Маркели и ти излез насреща, пък каквото Бог отсъди.“?", ["Кардам", "Телериг", "Крум", "Паган"], 0, "Посланието на ромейския василевс е по повод заплаха да нахлуе в Тракия и да стигне до Златните врата. Това довежда до военна конфронтация между двамата владетели край Маркели, където впоследствие византийците са сразени.", "https://bg.wikipedia.org/wiki/%D0%9A%D0%B0%D1%80%D0%B4%D0%B0%D0%BC");
q33 = new Question("В коя битка цар Симеон се съюзява с печенегите и извоюва първата голяма българска победа срещу маджарите?", ["Битката при Дръстър", "Битката при Южен Буг", "Битката при Северна Дакия", "Битката при Източна Панония"], 1, "Битката от 896 г. в днешна Украйна е в отговор на маджарската агресия от края на IX в. След няколко дребни сблъсъци в Северна Добруджа, Симеон се съюзява с печенегите и с тяхна помощ нанася тежко поражение на маджарите при река Буг. Впоследствие маджарите биват неутрализирани като византийски съюзници, което подсигурява северните граници на България.", "https://bg.wikipedia.org/wiki/%D0%A1%D0%B8%D0%BC%D0%B5%D0%BE%D0%BD_I#%D0%9F%D1%8A%D1%80%D0%B2%D0%B8_%D0%B2%D0%BE%D0%B9%D0%BD%D0%B8_%D1%81_%D0%92%D0%B8%D0%B7%D0%B0%D0%BD%D1%82%D0%B8%D1%8F_%D0%B8_%D0%BC%D0%B0%D0%B4%D0%B6%D0%B0%D1%80%D0%B8%D1%82%D0%B5");
q34 = new Question("При управлението на кой български владетел се провежда първата известна на историографията война между България и сърбите?", ["Тервел", "Омуртаг", "Пресиян", "Самуил"], 2, "В засвидетелстваните от изворите данни първата война между българи и сърби в историята на двата народа се води в периода 839-842 г. Конфликтът е породен поради намесата на византийската дипломация, която успява да убеди сръбския княз Властимир да ангажира вниманието на българските въоръжени сили, докато ромеите укрепват позициите си в Южна Тракия.", "https://bg.wikipedia.org/wiki/%D0%9F%D1%80%D0%B5%D1%81%D0%B8%D1%8F%D0%BD");
q35 = new Question("Подредете дадените български владетели по хронологичен ред на управление.", null, 0, "По хронологичен ред първо са хановете, после имаме князеи на края на първата българска държава за царете.", "https://bg.wikipedia.org/wiki/%D0%91%D1%8A%D0%BB%D0%B3%D0%B0%D1%80%D1%81%D0%BA%D0%B8_%D0%B2%D0%BB%D0%B0%D0%B4%D0%B5%D1%82%D0%B5%D0%BB%D0%B8");

questions = [q0, q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11, q12, q13, q14, q15, q16, q17, q18, q19, q20, q21, q22, q23, q24, q25, q26, q27, q28, q29, q30, q31, q32, q33, q34, q35];

function getRandom(diff) {
    var br = 0;
    while (br != 10) {
        var rand = Math.floor(Math.random() * 15);
        if (diff == 1) {
            rand += 10;
        }
        else if (diff == 2) {
            rand += 20;
        }
        if (!questions[rand].used) {
            ques[br] = questions[rand];
            br++;
            questions[rand].used = 1;
        }
    }
}



function fill(array) {
    for (var i = 1; i < 11; i++) {
        idq = "q" + i;
        document.getElementById(idq).innerText = i + ". " + array[i - 1].qtext;
        for (var j = 1; j < 5; j++) {
            document.getElementById(i * 10 + j).innerHTML = array[i - 1].ans[j - 1];
        }
    }
}

window.onload = function () {

    getRandom(document.getElementById("diff").innerHTML);
    fill(ques);
}

function check() {
    var flag = 0;
    for (var i = 1; i <= 10; i++) {
        if (document.forms['quiz']["q" + i].value != ques[i - 1].right) {
            wrongs[wrong] = i;
            document.getElementById("wrong" + wrong).innerText = i + ". " + ques[i - 1].qtext;
            document.getElementById("info" + wrong).innerText = ques[i - 1].info;
            document.getElementById("link" + wrong).href = ques[i - 1].link;
            document.getElementById("i" + wrong).style.display = "block";
            wrong++;
            wrong2++;
        }
    }
    for (var i = 0; i < 6; i++) {
        if (document.getElementById("n" + (i + 10)).value != time_table[i]) {
            if (flag == 0) {
                wrongs[wrong] = 11;
                document.getElementById("wrong" + wrong).innerText = "11" + "." + questions[35].qtext;
                document.getElementById("info" + wrong).innerText = questions[35].info;
                document.getElementById("link" + wrong).href = questions[35].link;
                document.getElementById("i" + wrong).style.display = "block";
                wrong2++;
            }
            wrong++;
            flag = 1;
        }
    }
}
function endIt() {
    if (end) {
        location.reload();
        return false;
    }
    else if (done < 16) {
        document.getElementById("dont").style.visibility = "visible";
        return false;
    }
    check();
    document.getElementById("dont").style.visibility = "hidden";
    document.body.scrollTop = document.documentElement.scrollTop = 0;
    document.getElementById("numa").innerText = "Верни";
    document.getElementById("num").innerText = (16 - wrong);
    document.getElementById("submit").innerText = "Опитай пак";
    end++;
    document.getElementById("quiz").style.display = "none";
    document.getElementById("end").style.display = "block";
    
    document.getElementById("quiz").outerHTML = "";
    if (wrong == 0) {
        document.getElementById("endt").innerText = "Всички отговори са верни! Поздравления!";
    }
    else {
        var str = "";
        for (var i = 0; i < wrong2; i++) {
            str += wrongs[i] + " ,";
        }
        str = str.substring(0, str.length - 1);
        document.getElementById("errors").innerText = str;
    }

}
window.setInterval(timer, 1000)

function timer() {
    if (end) {
        return false;
    }
    var sec = document.getElementById("sec").innerHTML;
    var min = document.getElementById("min").innerHTML;
    if (sec == 59) {
        sec = "00";
        min++;
        document.getElementById("min").innerHTML = min;
        document.getElementById("sec").innerHTML = sec;
    }
    else {
        sec++;
        if (sec / 10 < 1) {
            sec = "0" + sec;
        }
        document.getElementById("sec").innerHTML = sec;
    }
}

function count(event) {
    var num = event.target.name.substr(1);
    if (set[num - 1]) {
        return false;
    }
    else {
        done++;
        document.getElementById("num").innerText = done;
        set[num - 1]++;
    }
}

function timeTable(event) {
    var id = event.target.id.substr(1);
    if (set[id] == 1 && document.getElementById(event.target.id).value != "") {
        return false;
    }
    else if (set[id] == 1 && document.getElementById(event.target.id).value == "") {
        set[id] = 0;
        done--;
        document.getElementById("num").textContent = done;
    }
    else if (document.getElementById(event.target.id).value == "") {
        return false;
    }
    else {
        done++;
        document.getElementById("num").textContent = done;
        set[id] = 1;
    }
}
